import 'package:gym/model/Exercise.dart';

import '../../model/part.dart';

class Data{

  static List<Exercise> exercise = [
    Exercise(0,"بنج بريس مستوي", "يستهدف عضلة الصدر الوسط","عضلة الصدر",frame: 6),
    Exercise(1,"بنج بريس اعلى", "يستهدف عضلة الصدر العليا","عضلة الصدر",frame: 40),
    Exercise(2,"بنج بريس اسفل", "يستهدف عضلة الصدر السفلى","عضلة الصدر",frame: 20),
    Exercise(3,"فتح فراشة", "عمل ستريس للعضلة","عضلة الصدر",frame: 5),
    Exercise(4,"فتح دمبلص", "عمل ستريس للعضلة","عضلة الصدر",frame: 4),

    ///////////////////////////////////////////////////////////
    Exercise(5,"ضغط حديد جالس", "يستهدف عضلة الكتف الوسطى","عضلة الكتف",frame: 15),
    Exercise(6,"نشر دمبلص منحني", "يستهدف عضلة الكتف الخلفية","عضلة الكتف",frame: 15),
    Exercise(7,"نشر دمبلص للجانب واقف", "يستهدف عضلة الكتف الوسطى","عضلة الكتف",frame: 25),
    Exercise(8,"ضغط دمبلص جالس", "يستهدف عضلة الكتف الوسطى","عضلة الكتف",frame: 15),
    Exercise(9,"نشر دمبلص للامام", "يستهدف عضلة الكتف الوسطى","عضلة الكتف",frame: 5),

    ///////////////////////////////////////////////

    Exercise(10,"بايسبس (كيل) حديد وسط واقف", "يستهدف العضلة الوسطى","عضلة البايسبس(الكيل)",frame: 5),
    Exercise(11,"دمبلص مترادف واقف", "يستهدف الجزء الخارجي","عضلة البايسبس(الكيل)",frame: 5),
    Exercise(12,"بايسبس (كيل) z ضيق لاري", "يستهدف الجزء الداخلي","عضلة البايسبس(الكيل)",frame: 5),
    Exercise(13,"دمبلص تم متكى على الركبة", "يستهدف العضلة ككل","عضلة البايسبس(الكيل)",frame: 5),
    Exercise(14,"بايسبس (كيل) z وسط واقف", "يستهدف العضلة الوسطى","عضلة البايسبس(الكيل)",frame: 5),
    //////////////////////////
    Exercise(15,"تراي حديد ضيق نائم", "يستهدف الراس الخارجي","عضلة الترايسبس",frame: 5),
    Exercise(15,"تراي اله حبل نحو الاسفل", "يستهدف الراس الخارجي","عضلة الترايسبس",frame: 5),


  ];

  static List<Part> parts = [
    Part("تمارين الصدر", [0,1,2,3,4]),
    Part("تمارين الكتف", [5,6,7,8,9]),
    Part("تمارين البايسبس(كيل)", [10,11,12,13,14]),
    Part("تمارين الترايسبس", [15,16]),
    // Part("تمارين الساعد", []),
    Part("تمارين الظهر", []),
    // Part("تمارين السمانة(الغولف)", []),
    Part("تمارين الارجل", []),
  ];

}